<?php
/**
 * --------------------------------------------------------------------------------------------
 * RU/EN: Маршруты API / API Routes
 * --------------------------------------------------------------------------------------------
 *
 * Маршруты HTTP WEB представления, главной страницы проекта и документации api. Данный файл
 * без особой надобности редактировать вручную не следует. Он формируется автоматически на
 * основании конфигурационных данных и шаблонов представления (стандартных или кастомных,
 * это уже как пойдет)
 */

//TODO создать тестовый маршрут
