<?php
/**
 * --------------------------------------------------------------------------------------------
 * RU/EN: Создаем экземпляр класса приложения / Creating an instance of the application class
 * --------------------------------------------------------------------------------------------
 *
 * Стартовый компонент приложения, создает и возвращает экземпляр класса приложения.
 */


/**
 * --------------------------------------------------------------------------------------------
 * RU/EN: Это временная заглушка / This is a temporary stub
 * --------------------------------------------------------------------------------------------
 *
 * Временная заглушка кода / This is a temporary code stub
 * По завершении редактирования файла УБРАТЬ!
 */

echo "Привет! К работе готов!";

//TODO необходимо создать класс (Применить паттерн "Фабрика", принудительно заполнить нужные поля класса)


/**
 * --------------------------------------------------------------------------------------------
 * RU/EN: Возвращаем подготовленный экземпляр приложения / Return a prepared application instance
 * --------------------------------------------------------------------------------------------
 *
 * Правильно подготовленный экземпляр класса возвращается вызывающему.
 *
 */

//TODO необходимо создать возврат экземпляра класса

