<?php
/**
 * Главный исполняемый файл клиентского приложения (его интерактивная часть)
 * Для начала в нем будет реализовано подключение нужных классов и организация работы
 * REST API сервиса
 * WeB интерфейса пока не будет, документация формируется автоматически фреймворком,
 * в виде итоговых статичных страниц, обращение к которым существенно не загружает сервер
 * информация представленная на страницах документации напрямую опирается на конфигурацию
 * и автоматически изменяется при переформировании проекта (с учетом новых конфигурационных данных)
 * сами изменения легко отследить по данным GIT (если пользователь не захочет по какой-то причине
 * хранить все только на локальной машине вне сервиса контроля версий...
 */